simulation/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (-2.812 0 -1.22) // 0
    (1.268 0 -1.22) // 1
    (1.268 1.3 -1.22) //2
    (-2.812 1.3 -1.22) //3
    (-2.812  0 1.22) //4
    (1.268  0 1.22) // 5
    (1.268  1.3 1.22) //6
    (-2.812  1.3 1.22) //7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (34 13 24) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    frontWall
    {
        type patch;
        faces
        (
           (4 5 6 7) 
        );
    }
    backWall
    {
        type patch;
        faces
        (
            (0 3 2 1)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (0 1 5 4)
        );
    }
    upperWall
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }
);


// ************************************************************************* //
